nhm-ide/README.tex
% Created 2016-10-12 Wed 08:23
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{richardt}
\date{\today}
\title{NHM IDE - how it works}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

This is the repository for the NHM IDE. It contains the code to make the application work, but not the code for the model or the API between the application and the model.

It's built using \href{https://eclipse.org/tycho/}{tycho}, which is a set of maven plugins for building Eclipse applications. To explain what and why this is a thing, here is a quick rundown of some key Eclipse concepts and words;

\begin{itemize}
\item Eclipse / the Eclipse Rich Content Platform is a framework for making desktop applications
\item It's made of various layers, like a lot of things
\item In the middle is "Equinox" which is an OSGi runtime
\item The basic unit for eclipse is the OSGi bundle (bundle). A bundle is just a jar file, but it has extra stuff in its META-INF/MANIFEST.MF file which does a few things. This extra stuff is:
\begin{itemize}
\item A name and version number
\item A list of "exported" packages and their version numbers; an exported package contains types that are visible to other bundles in the runtime
\item Dependency specifications in the form of:
\begin{itemize}
\item Require-Bundle: headers - these are an old-fashioned way to say that one bundle needs another bundle to work; they refer to the name and version (or range) of that bundle. When the runtime tries to install and load up the bundle, it will make sure it can find the dependency and it will stick its exported packages onto the classpath
\item Import-Package: headers - these are the newer and better way to specify dependencies; they give a package name and version (or range), and the runtime will make sure that an implementation of that package at that version is on the classpath. The difference here is that more than one bundle can provide a particular package.
\end{itemize}
\item Stuff to do with providing services to the platform, in the form either of a Bundle-Activator: header which names a class that will get instantiated and have some methods called on it by the framework when the bundle is loaded, or
\item OSGi declarative services stuff, which has some manifest headers that refer to some XML files usually in OSGI-INF/something.xml; these tell the framework to new up some class AND publish it to the platform as a service.
\end{itemize}
\item As mentioned, OSGi bundles provide "services" to each other
\item A service is just an implementation of some interface
\item A bundle can ask the runtime to provide it with implementations of some service
\item Bundles can also supply classes that provide some services
\begin{itemize}
\item for example, you could publish HTTP servlets to the runtime under the servlet interface, and a web-serving part could consume those objects and wire them up to HTTP request handlers
\end{itemize}
\item One more thing; in Eclipse, some bundles are also "plugins". A plugin is a bundle which has a "plugin.xml" file in it as well. This plugin.xml contains (suprisingly enough) some XML, which is used to wire stuff up to the eclipse platform's user interface in some declarative, lazy-loaded way. The word to google here is "extension point"; for example to stick a button in a toolbar from your plugin, you contribute to the relevant extension point from the plugin.xml. The XML says what toolbar to put the button in, what icon and text to give it, and what class to instantiate when the button is actually used. This is how most bits of Eclipse's UI are connected up
\end{itemize}

\section{Key parts}
\label{sec-1}

There are several maven modules in this repository; each one builds part of the application

\subsection{cse.nhm.ide.build}
\label{sec-1-1}

This is what brings all the stuff together into what is called a \emph{product}; this is an installable zip file with a launcher icon and all the dependencies. Inside here are a very few files:

\begin{enumerate}
\item NHM.product is an eclipse product definition file; it is kind of a config file which says where the main method is and what features should go into the build (a feature is a collection of plugins or bundles)
\item plugin$_{\text{customization}}$.ini is a properties file which overrides default settings in the application when it's started up
\item the ubiquitous pom.xml, which just tells tycho to build an app
\end{enumerate}

\subsection{cse.nhm.ide.feature}
\label{sec-1-2}

This also just has a few parts, mainly the \texttt{feature.xml} file. This is an eclipse feature definition, which defines a group of plugins that all go together and do something. In this case our feature contains all the NHM specific plugins plus the eclipse plugins that we depend on to make it all work.

\subsection{cse.nhm.ide.product}
\label{sec-1-3}

This is a plugin, but it only has one interesting thing, which is an extension point defining a product - for some reason this doesn't go in \texttt{.build}, but \texttt{.build} does refer to the product extension which is defined in there. You probably won't need to touch it

\subsection{cse.nhm.ide.ui}
\label{sec-1-4}

This plugin is used by most of the other NHM related plugins. It defines what is called the "NHM Project Nature"; in eclipse a project may have several "natures". A nature adds some kind of behaviour to the project. The NHM nature adds:

\begin{itemize}
\item The project-specific preference about NHM versions
\item A project "builder", in NHMBuilder; this is the code which runs the validation when you save. Builders are triggered when some files in the project are modified.
\end{itemize}

The main useful stuff in this is provided by NHMNature; other plugins which want to use the NHM for a project will typically use NHMNature.of(IProject) to get an instanceof NHMNature for some project, and then .getModel() on that to get an INationalHouseholdModel. This will be an instance of ServiceTrackingModel, which does the work of finding the right version from the many versions installed, and switching versions in response to preference changes on the project.
