nhm-ide/README.org
** cse.nhm.ide.runner.api, .local, .remote and .ui
These guys actually do something, and are an example of how OSGi services often work; the =.api= bundle contains interface definitions for things that run scenarios. =.local= and =.remote= publish implementations of those services, and =.ui= consumes those implementations and wires up user-interface stuff to make a view, buttons for triggering a run, and so on.

The broad structure is:

 - runner.api
   - Interfaces
     - IScenarioRunner represents a thing which runs jobs and has a list of jobs, each job being an
     - IScenarioRun, which provides the methods to cancel / get results etc.
   - Utility classes
     - ScenarioRunner which is an abstract base class for IScenarioRunner - it is where the basic stuff to do with doing a run happens, like collecting up the inputs and hashing it all down to an ID. Base classes implement doSubmit, and invoke the updated() method to keep the state current.
 - runner.local
   Extends ScenarioRunner to LocalScenarioRunner and implements LocalScenarioRun; these classes do scenario running by storing the run metadata and stocks in the local filesystem in a plugin-specific metadata folder in the workspace. There is a single execution thread which goes through jobs and runs them one at a time.
 - runner.remote
   Also extends ScenarioRunner to give RemoteRunner and RemoteRun; it also adds a preference page extension to let you manage a list of servers. Each server defined in the preferences produces a RemoteRunner instance which is provided as a service to the rest of the runtime. These talk HTTP using the basic HttpUrlConnection; all the code for that is in the RemoteRunner, so that defines the API used really.
 - runner.ui
   This is the consumer for runner.remote and runner.local, and has a few things in it:
   - Commands - a command is what backs buttons, menus etc in the eclipse UI. Each command may have one or more handlers, where a handler is the class that does the work. Different handlers are activated in different situations; mostly this is handled by some stuff in plugin.xml. One of the commands does actual interesting work, namely GetResultsCommandHandler - this is where batch outputs are stitched together.
   - Views - this is where the list of jobs and so on lives. There is an interesting thing here which is the ScenarioRunnerTracker; this is the connection to OSGi which gets told when you add or remove an IScenarioRunner service from the runtime.
** cse.nhm.ide.ui.editor
Contains the scenario editor, and is responsible for:

- hover help
- suggestions (control space)
- syntax highlighting
- snippets / templates in eclipse speak
- scenario editor bracket and motion commands
- jump-to-thing (control shift T) and outline (control o) in scenarios
** cse.nhm.ide.stock.ui
Contains the stock browser and the stock import wizard.
** cse.nhm.ide.ui.results
Contains the tab file viewer
** cse.nhm.models.feature
Contains the single file =feature.xml=; this needs to be updated when we do an nhm model release; the stanzas in the <requires> block are what cause the different model versions to get included into the build. Each bundle impl has a version like x.y.z.R1234566; the dependencies for those are specified with match="equivalent", which instructs P2 to find the highest version whose first two version digits match. For example, if the repository contains

- 6.4.1.D123456
- 6.3.0.R123465
- 6.3.1.R567675
- 6.3.1.R787878
- 6.3.1.D999999

6.3.0 equivalent will pick 6.3.1.R787878. 6.4.0 equivalent will pick 6.4.1.D123456. Each part of the version is compared numerically except the qualifier (the last bit), which is compared lexically.
** cse.nhm.jre.win64.feature
Contains a copy of the JRE, which is built into the windows version.
* Running in eclipse vs building with tycho
Eclipse programs are built (or in eclipse speak, "provisioned") using a complicated nightmare called P2 (Provisioning Protocol I think, or something like that). A thing called the P2 director takes a set of P2 repositories and a definition of a thing to build (this is the .product file mentioned before), and solves the dependency problem to find a set of bundles that can make the product work.

A P2 repository is a bit like a maven repo, except it has an index that knows much more about the things in the repo. Specifically, it knows the MANIFEST.MF metadata for all the jars it contains, including the package and bundle dependencies & versions for everything. The P2 director reads in all this metadata for all the repositories which are being used, which comprises what is called the /target platform/. Then it does a big solving job to find a set of bundles which meets all the requirements; this is harder than it sounds.

Remember that a bundle depends on particular version ranges of packages, which may be exported by many other bundles, so it's not just doing some transitive resolution by name. P2 can solve all kinds of horrible diamond problems between your dependencies, which is nice, but unfortunately if it gets stuck you may have a bit of a problem. For P2 to be able to do its job, everyone has to spell out their dependencies correctly, and sometimes if someone is a bit overzealous the situation can get unsatisfiable. In this case it can be a matter of bodging the maven configuration to filter certain plugins from the target platform, so they can't jam everything up.

Anyway, the point is that you have a target platform which is full of plugins, and the build system's job is to assemble a set of plugins which let your product work properly.
** Building with tycho
The build itself is simple: in the top level, mvn clean package

The application builds are stored in cse.nhm.ide.build/target/products/ as zip files; you can unzip one of these and run it directly.

Tycho knows the P2 repositories which define the target platform from the pom.xml; in our build, the target platform consists of:

 - the submodules in the ide
 - a few remote P2 repositories
   - eclipse mars, which contains the base eclipse stuff
   - eclipse orbit, which contains some other dependencies not in eclipse needed by the results view ("glazed lists")
   - eclipse nebula's NatTable, which contains the grid control used by the results plugin
   - the NHM p2 repository http://p2.research.cse.org.uk/ (username tom.hinton@cse.org.uk password 'password')
 - The POM dependencies which are OSGi bundles; this is used for one dependency (the JSON parser) which is not in any of the P2 repositories. Using maven repos for bundles is not really a good thing in general, as maven's dependency information is really limited.
** Running in eclipse
First off, you need the right kind of eclipse; go to http://www.eclipse.org/downloads and get the "Eclipse for RCP and RAP developers".

Eclipse has quite good integration with Tycho these days, but it cannot yet understand the target platform from the pom in the same way, or run a product that's built by the pom directly. Instead, we need to set up a few things:
