nhm-ide/README.org
*** Target platform
First, eclipse needs to know the target platform; for this, eclipse uses .target files, which contain the same information as the pom does, i.e. a list of repositories that should contain stuff to be considered for the build.

The repository contains a target definition in the =cse.nhm.ide.target= folder; this isn't part of the maven build, and is only there to make it possible to run stuff from within eclipse. So, to make this work you need to:

1. Import the =cse.nhm.ide.target= project into eclipse (import existing maven projects)
2. Open the target platform file =flip.target= in that project - this gets you the target platform editor, which is pretty flaky I'm afraid
3. Hit the "reload" button on the right, which is usually a good idea - this will think for a while, as it downloads all the metadata and does some hard maths
4. If necessary, save the target file (hopefully not necessary)
5. Click "set as target platform" in the top right bit of the editor

Eclipse will have a think, and build errors should go away. If the target definition shows some errors, panic and wave your arms in the air. The first entry in the list (${project_loc}/bundles/) sometimes doesn't work, you can sometimes fix that by editing it (Edit button) and making no change (Finish button) to give eclipse a kick.

Once your target platform is set, eclipse will be able to build everything, hopefully.
*** Run configuration from product
To run a thing in eclipse, you need a run configuration; the easiest way to get this sorted to start with is to open =NHM.product= (C-S-R NHM.product, RET), and in the "Overview" tab click "Launch an Eclipse application". You only need to do this once, after which you can forget the product file; generally you want to avoid fiddling with it as it defines the dependencies and multi-platform build stuff. Anyway, you should now get the run configuration window come up, and have a run configuration in the run dropdown called =nhm=. This will launch the NHM app.

If this has problems, you may need to make sure the run configuration has all the plugins it needs in it; this can end up wrong when a new build of the implementation plugin happens.

To do this, open the run configurations window, and look at the =nhm= run configuration (under Eclipse Application). You will see on that a "Plug-ins" tab. Mostly if something is not working, you can click "Add required plugins" and all will be well. Otherwise, you may need to manually fiddle with the auto-start column for a particular plugin.
** Deployment & updates
There is a deploy job on the build server; this just uses scp to copy some files onto the deccnhm server, in a folder that's served up over http. It copies:

1. the product zip files, which you can get from http://deccnhm.org.uk/standalone/
2. the p2 repository for the product which is at http://deccnhm.org.uk/p2/

The second is what is used for updates.
* External dependencies
** API & impl bundles
All the actual nhm code is built into versions of the implementation bundle; this connects to the GUI by publishing an instance of INationalHouseholdModel, which is an interface defined in the API bundle. Both of these are built by gradle and published to the CSE internal p2 repository at http://p2.research.cse.org.uk/
** Documentation
The nhm-documentation project contains a submodule which builds eclipse documentation; this is also published to the p2 repository
** p2 repository
The aforementioned p2 repository is accessible using my top-secret credentials:
 - tom.hinton@cse.org.uk / password
It's a program called package-drone, which seems to work quite well. It does one particularly clever thing for us, which is to automatically create a "feature" that helps the target platform file work in eclipse.
